Revit 2027 API
RebarShapeConstraint180DegreeBendRadius Constructor
 Create a 180-degree bend constraint driven by radius.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public RebarShapeConstraint180DegreeBendRadius(
	ElementId paramId,
	RebarShapeArcReferenceType refType
)
Public Sub New (
	paramId As ElementId,
	refType As RebarShapeArcReferenceType
)
public:
RebarShapeConstraint180DegreeBendRadius(
	ElementId^ paramId,
	RebarShapeArcReferenceType refType
)
new :
        paramId : ElementId *
        refType : RebarShapeArcReferenceType -> RebarShapeConstraint180DegreeBendRadius
Parameters
paramId ElementId
 The Id of a Rebar Shape parameter.
refType RebarShapeArcReferenceType
 A choice of rule for measuring the radius.
Exceptions
Exception | Condition
ArgumentException |  paramId is not a valid Element identifier.
ArgumentNullException |  A non-optional argument was null
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
RebarShapeConstraint180DegreeBendRadius Class
Autodesk.Revit.DB.Structure Namespace